export const START = {
  GREETING: userName => `Привіт, ${userName}!`,
  SEND_PHONE_REQUEST: 'Для початку роботи надішли свій номер телефону.',
  SEND_PHONE_LABEL: '📲 Надіслати номер телефону',
  PHONE_ADD_SUCCESS: 'Номер успішно додано в базу даних 👍',
  SEND_STATS_HINT: 'Для надсилання статистики використай команду /send_stats або почекай, поки бот зробить тобі нагадування 😉',
  PHONE_NOT_FOUND: 'Номер не знайдено в базі даних. Бот працює тільки зі студентами Семінарії.'
};

export const INTERCEPTER = {
  NOT_AUTHORIZED: 'Неавторизований користувач. Натисни /start для логіну, якщо ти студент Семінарії, або'
};

export const STATS_WIZARD = {
  PRAYER_QUESTION: 'Скільки часу було проведено в спілкуванні з Богом (молитва, читання Писання) протягом минулого тижня?\nВведи дані у форматі [ГОД ХВ], наприклад: 4 20',
  WITNESSES_QUESTION: 'Скільком людям було засвідчено про Христа протягом минулого тижня?\nВведи дані у форматі [КІЛЬКІСТЬ], наприклад: 3',
  DATA_SAVE_SUCCESS: 'Дані успішно збережено.',
  DATA_SAVE_ERROR: 'Не вдалося зберегти дані. Звернися в технічну підтримку.',
  DATA_ALREADY_SAVED: 'Дані за минулий тиждень вже збережені.',
  DATA_INPUT_CANCELED: 'Введення даних скасовано.',
  INCORRECT_DATA_FORMAT: 'Неправильний формат вхідних даних. Спробуй знову.\nДля скасування використай команду /cancel',
  BACKEND_QUERY_ERROR: 'Помилка опитування бекенду. Звернися в технічну підтримку.'
};

export const SCHEDULER = {
  STATS_REMINDER: 'Нагадування: введи дані за минулий тиждень, будь ласка. Для цього використай команду /send_stats'
};
